/*
* Варіант 30
* 
* Побудувати і вивести на екран дерево виразу
*   9 + 8 * ( 7 + ( 6 * ( 5 + 4 ) - ( 3 - 2 ) ) + 1 )
-------------------------------------------------------------------

  |'+'               |'9'              |'9'
    |'9'           |'+'                | |'8'
    |'*'             | |'8'            | |   |'7'
      |'8'           |'*'              | |   |   |'6'
      |'+'             |   |'7'        | |   |   | |'5'
        |'+'           | |'+'          | |   |   | |'4'
        | |'7'         | | |   |'6'    | |   |   |'+'
        | |'-'         | | | |'*'      | |   | |'*'
        |   |'*'       | | | | | |'5'  | |   | | |'3'
        |   | |'6'     | | | | |'+'    | |   | | |'2'
        |   | |'+'     | | | |   |'4'  | |   | |'-'
        |   |   |'5'   | | |'-'        | |   |'-'
        |   |   |'4'   | |   | |'3'    | | |'+'
        |   |'-'       | |   |'-'      | | |'1'
        |     |'3'     | |     |'2'    | |'+'
        |     |'2'     |'+'            |'*'
        |'1'             |'1'         '+'

        прямий         симетричний      зворотний

-------------------------------------------------------------------
* Реалізувати обходи дерева:
* постфіксний, інфіксний, префіксний (зворотний, симетричний, прямий)
* вивести ці виразу на екран
* 
* (примітка: у завданні є одна зайва дужка в кінці, тому її немає в цьому виразі)
*/ 

#include "Header.h"
#include "windows.h"

int main()
{
    SetConsoleCP(1251);
    SetConsoleOutputCP(1251);
    std::string formula = "9+8*(7+(6*(5+4)-(3-2))+1)";
    Tree* tree;
    size_t treeHeight = 0;
    bool* levels;
    tree = new Tree(formula, treeHeight);

    levels = new bool[treeHeight+1];
    for (size_t i = 0; i < treeHeight; i++)
    {
        levels[i] = false;
    }
    std::cout << "Прямий обхід: \n";
    outDirect(tree->root, 0, levels);
    std::cout << "Префіксальний вигляд виразу: \n";
    outPrefExpr(tree->root);

    std::cout << "\nСиметричний обхід: \n";
    outSymm(tree->root, 0, levels, false, false);
    std::cout << "Інфіксальний вигляд виразу: \n";
    outInfExpr(tree->root);

    std::cout << "\nЗворотний обхід: \n";
    outRev(tree->root, 0, levels);
    std::cout << "Постфіксальний вигляд виразу: \n";
    outPostfExpr(tree->root);
}

