/*
Визначити клас "Roman_numerals", який задає число в римській формі запису (рядок)

Реалізувати для заданого класу:
декілька конструкторів, геттери, методи перетворення числа у десяткове

Перевантажити оператори:
префіксний "++" для інкрементації даного числа
"+=" для збільшення його на вказане римське число
"+" для додавання двох римських чисел

Cтворити три римських числа (R1, R2, R3), використовуючи різні конструктори
Інкрементувати число R1, R2 збільшити на вказану величину
Знайти суму R1 + R2 та зберегти її в R3
Перевести R3 в десятковий формат
*/

#include "Header.h"
#include "RomanNumeral.h"

int main()
{
    
}